M-Moeini/MQTT-NRF51822/finalMQTT/99-08-29/salem1/examples/ble_central/ble_app_uart_c/main.c
/*
 * Copyright (c) 2016 Nordic Semiconductor. All Rights Reserved.
 *
 * The information contained herein is confidential property of Nordic Semiconductor. The use,
 * copying, transfer or disclosure of such information is prohibited except by express written
 * agreement with Nordic Semiconductor.
 *
 */
#include <stdarg.h>
#include <stdio.h>
#include <stdint.h>
#include <stdbool.h>
#include "nordic_common.h"
#include "app_error.h"
#include "ble_db_discovery.h"
#include "app_timer.h"
#include "app_util.h"
#include "bsp.h"
#include "bsp_btn_ble.h"
#include "boards.h"
#include "ble.h"
#include "ble_gap.h"
#include "ble_hci.h"
#include "softdevice_handler.h"
#include "ble_advdata.h"
#include "ble_nus_c.h"
#include "mqtt.h"
#include "nrf_delay.h"
#include "SEGGER_RTT.h"
#include "nrf_gpio.h"
#include	"SimplePubSub.h"
#include "gpio_init.h"
#include "nrf.h"
#define CENTRAL_LINK_COUNT      1                               /**< Number of central links used by the application. When changing this number remember to adjust the RAM settings*/
#define PERIPHERAL_LINK_COUNT   0                               /**< Number of peripheral links used by the application. When changing this number remember to adjust the RAM settings*/

#if (NRF_SD_BLE_API_VERSION == 3)
#define NRF_BLE_MAX_MTU_SIZE    GATT_MTU_SIZE_DEFAULT           /**< MTU size used in the softdevice enabling and to reply to a BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST event. */
#endif

#define UART_TX_BUF_SIZE        256                             /**< UART TX buffer size. */
#define UART_RX_BUF_SIZE        256                             /**< UART RX buffer size. */

#define NUS_SERVICE_UUID_TYPE   BLE_UUID_TYPE_VENDOR_BEGIN      /**< UUID type for the Nordic UART Service (vendor specific). */

#define APP_TIMER_PRESCALER     0                               /**< Value of the RTC1 PRESCALER register. */
#define APP_TIMER_OP_QUEUE_SIZE 2                               /**< Size of timer operation queues. */

#define SCAN_INTERVAL           0x00A0                          /**< Determines scan interval in units of 0.625 millisecond. */
#define SCAN_WINDOW             0x0050                          /**< Determines scan window in units of 0.625 millisecond. */
#define SCAN_ACTIVE             1                               /**< If 1, performe active scanning (scan requests). */
#define SCAN_SELECTIVE          0                               /**< If 1, ignore unknown devices (non whitelisted). */
#define SCAN_TIMEOUT            0x0000                          /**< Timout when scanning. 0x0000 disables timeout. */

#define MIN_CONNECTION_INTERVAL MSEC_TO_UNITS(100, UNIT_1_25_MS) /**< Determines minimum connection interval in millisecond. */
#define MAX_CONNECTION_INTERVAL MSEC_TO_UNITS(200, UNIT_1_25_MS) /**< Determines maximum connection interval in millisecond. */
#define SLAVE_LATENCY           0                               /**< Determines slave latency in counts of connection events. */
#define SUPERVISION_TIMEOUT     MSEC_TO_UNITS(4000, UNIT_10_MS) /**< Determines supervision time-out in units of 10 millisecond. */

#define UUID16_SIZE             2                               /**< Size of 16 bit UUID */
#define UUID32_SIZE             4                               /**< Size of 32 bit UUID */
#define UUID128_SIZE            16                              /**< Size of 128 bit UUID */

static ble_nus_c_t              m_ble_nus_c;                    /**< Instance of NUS service. Must be passed to all NUS_C API calls. */
static ble_db_discovery_t       m_ble_db_discovery;             /**< Instance of database discovery module. Must be passed to all db_discovert API calls */
char  AtBuff[50];
char  BtBuff[50];
bool mqtt_flag = 1;
bool Arrow_flag=0;
bool clinet_connect_f=0;
bool connect_flag=0;
bool true_f=0;
extern bool client_available_f;
extern bool connect_ack_f;
extern bool on_buf_f;
extern bool off_buf_f;
extern bool connectOK_f;
extern bool get_data_f;
extern char on_buf_array[70];
bool a_flag=0;
const char* topicInit = "GsmClientTest/init";
const char* topicLed = "GsmClientTest/led";
const char* broker="cloud.smarthoom.com";
char* payload="system is ready";
uint16_t plength=0;

uint8_t get_readline;
uint8_t retry_default=5;
uint8_t m=0;
uint32_t lastReconnectAttempt = 0;
int delay=0;



void sms(void)
{
//		AtBuff[0] = 0x41;	
//    AtBuff[1] = 0x54;
//   	AtBuff[2] = 0x1A;
//	  AtBuff[3] = 0x0D;
//		AtBuff[4] = 0x0A;
//		at_com("ATE0\r\n",1000,100);
//		at_com("AT\r\n",1000,100);
	at_com("AT+CMGF=1\r\n",1000,100);
	at_com("AT+CMGS=\"+989026473264\"\r\n",1000,100);
	at_com(BtBuff,1000,100);
	SEGGER_RTT_WriteString(0,"residm");
	at_com("AT\r\n",4000,100);
	//	at_com("AT\r\n",1000,100);	
}

void RESET(void)
{
		at_com("AT+CFUN=0\r\n",1000,10);
		nrf_delay_ms(12000);
		at_com("AT+CFUN=1\r\n",1000,10);
		nrf_delay_ms(12000);
 	  at_com_check("AT\r\n","\r\nOK\r\n",retry_default,10,10);
}

void GPRS_CON(void)
{
     //RESET();
		
    at_com("AT\r\n",1000,100);
    at_com("ATE0\r\n",1000,100);
    at_com("ATI\r\n",1000,100);
    at_com("AT+GMM\r\n",1000,100);
	
    //  at_com_check("AT\r\n","\r\nOK\r\n",retry_default);
		at_com_check("AT+CMEE=2\r\n","\r\nOK\r\n",retry_default,10,10);
   //at_com_check("AT+GMM\r\n","\r\nSIMCOM_SIM800L\r\n\r\nOK\r\n",retry_default);
		at_com_check("AT+GMM\r\n","\r\nOK\r\n",retry_default,10,10);
		at_com_check("AT+CLTS=1\r\n","\r\nOK\r\n",retry_default,10,10);			 
	  at_com_check("AT+CBATCHK=1\r\n","\r\nOK\r\n",retry_default,10,10);			 
    //at_com_check("AT+CPIN?\r\n","\r\n+CPIN: READY\r\n\r\nOK\r\n",5);	
	  at_com_check("AT+CPIN?\r\n","\r\nOK\r\n",5,10,10);		
    //at_com("ATI\r\n");
		//SEGGER_RTT_WriteString(0,"Waiting for network...\r\n");			 
		//at_com_check("AT+CREG?\r\n","\r\n+CREG: 0,1\r\n\r\nOK\r\n",retry_default);
		at_com_check("AT+CREG?\r\n","\r\nOK\r\n",retry_default,10,10);
		//SEGGER_RTT_WriteString(0,"Network connected\r\n");
	  at_com_check("AT+CIPSHUT\r\n","\r\nSHUT OK\r\n",retry_default,10,100); 
    //at_com("AT+CIPSHUT\r\n"); 
		at_com_check("AT+CGATT=0\r\n","\r\nOK\r\n",retry_default,500,1000); 
		//at_com("AT+CGATT=0\r\n",10,40); 	
		at_com_check("AT+SAPBR=3,1,\"Contype\",\"GPRS\"\r\n","\r\nOK\r\n",retry_default,500,1000);
		//at_com("AT\r\n");
		//SEGGER_RTT_WriteString(0,"residam\r\n");
		at_com_check("AT+SAPBR=3,1,\"APN\",\"mtnirancell\"\r\n","\r\nOK\r\n",retry_default,500,1000); 
		//at_com("AT\r\n");		
		at_com_check("AT+CGDCONT=1,\"IP\",\"mtnirancell\"\r\n","\r\nOK\r\n",retry_default,500,1000); 	
		//nrf_delay_ms(10000);		
		at_com_check("AT+CGACT=1,1\r\n","\r\nOK\r\n",retry_default,500,1000);
		//nrf_delay_ms(5000);
		//at_com("AT\r\n");		
		at_com_check("AT+SAPBR=1,1\r\n","\r\nOK\r\n",retry_default,1000,1000);	
		//at_com("AT\r\n");		
		at_com("AT+SAPBR=2,1\r\n",10,10);
		at_com_check("AT+CGATT=1\r\n","\r\nOK\r\n",retry_default,2000,1000);
		at_com_check("AT+CIPMUX=1\r\n","\r\nOK\r\n",retry_default,2000,1000);
		at_com_check("AT+CIPQSEND=1\r\n","\r\nOK\r\n",retry_default,2000,1000);
		at_com_check("AT+CIPRXGET=1\r\n","\r\nOK\r\n",retry_default,2000,1000);
		at_com_check("AT+CSTT=\"mtnirancell\",\"\",\"\"\r\n","\r\nOK\r\n",retry_default,2000,1000);
		at_com_check("AT+CIICR\r\n","\r\nOK\r\n",retry_default,2000,1000);
		at_com("AT+CIFSR;E0\r\n",1000,1000);
		at_com_check("AT+CDNSCFG=\"8.8.8.8\",\"8.8.4.4\"\r\n","\r\nOK\r\n",retry_default,1000,1000);
		SEGGER_RTT_WriteString(0,"success\r\n");
		//at_com_check("AT+CGATT?\r\n","\r\n+CGATT: 1\r\n\r\nOK\r\n",retry_default);
	  at_com_check("AT+CGATT?\r\n","\r\nOK\r\n",retry_default,1000,10);
		at_com("AT+CIFSR;E0\r\n",1000,10);
		//SEGGER_RTT_WriteString(0,"GPRS connected\r\n\r\n");
		//nrf_delay_ms(500);
}
void MQTT_INIT(void)
{
				 at_com_check("AT+CIPRXGET=4,0\r\n","\r\nOK\r\n",retry_default,100,100);
//  	   at_com_check("AT+CIPSTATUS=0\r\n","\r\nOK\r\n",retry_default,1000,100);
		     at_com_check("AT+CIPSTATUS=0\r\n","\r\nOK\r\n",retry_default,100,100);
		     at_com("AT+CIPCLOSE=0,1\r\n",100,100);
			   
