M-Moeini/MQTT-NRF51822/finalMQTT/99-08-29/salem1/examples/ble_central/ble_app_uart_c/main.c
}




int main(void)
{	

//		SEGGER_RTT_WriteString(0,"1\r\n");
//		char AtBuff[20];
//		sprintf(AtBuff,"AT\r\n");
//		getReply(AtBuff,1000);
//	  nrf_drv_gpiote_init();
//	  nrf_gpio_pin_dir_set(23, NRF_GPIO_PIN_DIR_OUTPUT);
	  //gpio_init();

    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, NULL);
	  my_timer_start();
		uart_init();		
		buttons_leds_init();
	  nrf_gpio_cfg_output(23);
	  nrf_gpio_pin_dir_set(23, NRF_GPIO_PIN_DIR_OUTPUT);
		nrf_gpio_pin_clear(23);
	  nrf_delay_ms(1000);
	  nrf_gpio_pin_set(23);
		db_discovery_init();
		ble_stack_init();
		nus_c_init();

	  //gpio_init();
	  GPRS_CON();
//	  MQTT_CALLBACK_SIGNATURE(*mqttCallback);

//	  if(connectOK_f)
//		{
//			SEGGER_RTT_WriteString(0,"connect is ok\r\n");
//		}
		MQTT_INIT();
		
		
//char buf10[20]="AT+CFUN=";
//int i=0;	
//int c=1;	
//char d;	
//char buf11[50]="ali";
//sprintf(BtBuff,"%d",c);	
//char*buf12="mmd";
////char buf13[20]=	
//	for(i;i<strlen(buf10);i++)
//	{
//		buf11[i]=buf10[i];
//	}
//	buf11[i]=BtBuff[0];
//	buf11[i+1]='\r\n';
//	
//	sprintf(BtBuff,"s=%s",buf11);
//	SEGGER_RTT_WriteString(0,BtBuff);
//	at_com(buf11,1,100);
	
		//SEGGER_RTT_WriteString(0,"2\r\n");
    // Start scanning for peripherals and initiate connection
    // with devices that advertise NUS UUID.
		//printf("Uart_c Scan started\r\n");

		// scan_start();

//	AtBuff = "AT\r\n" ;
//	sprintf(AtBuff,"AT+CMGS=\"+989026473264\"\r\n");
//  	
	
// 	AT+CMGF=1	
	
//	AtBuff[0] = 0x41;
//	AtBuff[1] = 0x54;
//	AtBuff[2] = 0x2B;
//	AtBuff[3] = 0x43;
//	AtBuff[4] = 0x4D;
//	AtBuff[5] = 0x47;
//	AtBuff[6] = 0x46;
//	AtBuff[2] = 0x3D;
//	AtBuff[2] = 0x31;
//	AtBuff[2] = 0x0D;
//	AtBuff[3] = 0x0A;
//	//AtBuff[4] = 0x;
		
//	ATE0		
		
//	AtBuff[0] = 0x41;
//	AtBuff[1] = 0x54;
//	AtBuff[2] = 0x45;
//	AtBuff[3] = 0x30;
//	AtBuff[4] = 0x0D;
//	AtBuff[5] = 0x0A;

//	CTRL+Z
//	AtBuff[0] = 0x41;
//	AtBuff[1] = 0x42;
//	AtBuff[2] = 0x43;
//	AtBuff[3] = 0x1A;
//	AtBuff[4] = 0x0D;
//	AtBuff[5] = 0x0A;


//	AtBuff[3] = 0x1A;
//	AtBuff[4] = 0x0D;
//	AtBuff[5] = 0x0A;


//	getReply(AtBuff,NULL, (uint16_t) 10);
//  nrf_delay_ms(100);
	
	
//  sprintf(AtBuff,"AT+CMGF=1\r\n");
//	getReply(AtBuff,NULL, (uint16_t) 10);
		
//	at_com("AT+CMGF=1\r\n");
//  at_com("AT+CMGS=\"+989026473264\"\r\n");
//  at_com("0x1A\r\n");

		
		
		
		
		
		
		
		
	
		
		
		
		
		
		
		
//		

//		
//	at_com("AT+CFUN=0\r\n");
//	at_com("AT+CFUN=1\r\n");
//	nrf_delay_ms(1000);
//	at_com_check("AT\r\n","\r\nOK\r\n");
		


    for (;;)
    { 
//		    if(connectOK_f)
//		    {
//		    	SEGGER_RTT_WriteString(0,"connect is ok\r\n");
//		    }
      
			//SEGGER_RTT_WriteString(0,"for\r\n");
 		  if(!connect_ack_f)
			 { //SEGGER_RTT_WriteString(0,"tu if\r\n");
		     uint32_t t = millis();
         if (t - lastReconnectAttempt > 20000L) 
					 { //readserver();
           lastReconnectAttempt = t;
           if (MQTT_CON())
						 {   SEGGER_RTT_WriteString(0,"mqttcon\r\n");
						      subscribe(topicLed);
							   //readserver();
//							 GF("+CIPSEND="), 0, ',', 33);
             lastReconnectAttempt = 0;
             }
						 
           }
			    nrf_delay_ms(100);
         
			}	
			    
//        if(client_available_f&&get_data_f)
//				{ SEGGER_RTT_WriteString(0,"hastammmmmmmmmmmmmmmmmm\r\n");
//				  readserver2();
//				}
				loop();
			  //SEGGER_RTT_WriteString(0,"hastammmmmmmmmmmmmmmmmm\r\n");
			 
//		if(connect_ack_f)
//		{
//      if(client_available_f)
// 			{    
////				at_com("AT+CIPRXGET=4,0\r\n",100,10);
//				  SEGGER_RTT_WriteString(0,"request\r\n");
//				  at_com("AT+CIPRXGET=4,0\r\n",100,10);
//				  nrf_delay_ms(100);
//				  if(on_buf_f)
//					{ on_buf_f=0;
//						SEGGER_RTT_WriteString(0,"LED is ON\r\n");
//						at_com("AT+CIPRXGET=2,0,23\r\n",100,10);
//					}
//					else if(off_buf_f)
//					{ 
//						off_buf_f=0;
//						SEGGER_RTT_WriteString(0,"LED is OFF\r\n");
//						at_com("AT+CIPRXGET=2,0,24\r\n",100,10);
//					}
//				
//				  client_available_f=0;
//			}	
//		}			
      
			while(mqtt_flag)
			{       
				
//				       {
//								    for(int i=0;i<strlen(on_buf_array);i++)
//                    {
//											//on_buf_array[i]=data_array[i];
//											sprintf(BtBuff,"h=%d\r\n",on_buf_array[i]);
//											SEGGER_RTT_WriteString(0,BtBuff);
//										}	
//							 }

//		          plength=strlen(payload);
//				      publish(topicInit,payload,plength);
//				      nrf_delay_ms(1000);
				        
//						char data_array1[4]={32,2,10,13};
//				    char data_array2[6]={32,2,0,0,10,13};
//				    SEGGER_RTT_WriteString(0,"result=");
//            for(int i=0;i<strlen(data_array1);i++)
//	          {
//				    sprintf(BtBuff,"%c",data_array1[i]);
//				    SEGGER_RTT_WriteString(0,BtBuff);
////	          	  if(i==strlen(data_array1))
////	          	 {
////				    sprintf(BtBuff,"%c\r\n",data_array1[i]);
////				    SEGGER_RTT_WriteString(0,BtBuff);
////	          	 }
//	          }
//						if(strcmp(data_array1,data_array2)==0)
//						{
//							SEGGER_RTT_WriteString(0,"mosavi\r\n");
//						}
				
//				
//					at_com("AT\r\n",1000,100);
//		 			at_com("ATE0\r\n",1000,100);
//		 		 	at_com("ATI\r\n",1000,100);
//					at_com("AT+GMM\r\n",1000,100);
				
//			 at_com("AT\r\n");
//	     at_com_check("AT\r\n","\r\n0K\r\n",2);
		     
//		   at_com("AT+CFUN=0\r\n");
//		   at_com("AT+CFUN=1\r\n");
//			 nrf_delay_ms(1000);
//		   at_com_check("AT\r\n","\r\nOK\r\n",retry_default);
//			 at_com_check("ATE\r\n","\r\nOK\r\n",retry_default);
//       connecting to irancell service	 
//				 GPRS_CON();
//			 millis();
//			 uint32_t nalis=millis();
		     
//         sprintf(BtBuff,"timer=%d\r\n",millis());
//	       SEGGER_RTT_WriteString(0,BtBuff);	
//	       nrf_delay_ms(16000);
//         sprintf(BtBuff,"timer=%d\r\n",millis());
//	       SEGGER_RTT_WriteString(0,BtBuff);
//				 nrf_delay_ms(8000);
//       at_com("fgijhogrhjgigigg\r\n");
//       at_com("\r\n");
		
	
	
//			SEGGER_RTT_WriteString(0,"Connecting to cloud.smarthoom.com\r\n");
	
//		  do
//			{
//		  	at_com_check("AT+CIPRXGET=4,0\r\n","\r\n+CIPRXGET: 4,0,0\r\n\r\nOK\r\n",retry_default);
//		  	at_com_check("AT+CIPSTATUS=0\r\n","\r\n+CIPSTATUS: 0,,\"\",\"\",\"\",\"INITIAL\"\r\n\r\nOK\r\n",retry_default);
//		  	at_com("AT+CIPCLOSE=0,1\r\n");
//		  	at_com_check("AT+CIPSSL=0\r\n","\r\nOK\r\n",retry_default);
//			}
//	    while(!at_com_check("AT+CIPSTART=0,\"TCP\",\"cloud.smarthoom.com\",1883\r\n","\r\n0, CONNECT OK\r\n\r\nOK\r\n",0));
			
