M-Moeini/MQTT-NRF51822/finalMQTT/99-08-29/salem1/examples/ble_central/ble_app_uart_c/main.c
//			at_com_check("AT+CIPRXGET=4,0\r\n","\r\nOK\r\n",retry_default);

//		 	sms();

       				
			
			
//			at_com("A",100,100);
//			a_flag=1;
//			at_com("T\r\n",100,100);
//			
			
			
//			nrf_delay_ms(1000);
//		  readline((ui nt16_t) 500);

//	    at_com_check(NULL,"\r\n0, CONNECT OK\r\n\r\nOK\r\n",1);
//	    at_com_check("AT\r\n","\r\nOK\r\n\r\n0, CONNECT OK\r\n",retry_default);
//	    at_com_check("AT\r\n","\r\nOK\r\n",retry_default);
			
			
//			 				 
//      nrf_delay_ms(1000);
//      at_com_check("AT\r\n","\r\nOK\r\n",retry_default);	
//      Arrow_flag=1;
	

//      nrf_delay_ms(4000);
//      sprintf(BtBuff,"connect_flag=%d\r\n",connect_flag);
//      SEGGER_RTT_WriteString(0,BtBuff);


//			if(connect_flag)
//				{



//							nrf_delay_ms(30000);
//							at_com("AT\r\n",4000,10);
//					    at_com("AT\r\n",1000,100);
//		 			    at_com("ATE0\r\n",1000,100);
//		 		 	    at_com("ATI\r\n",1000,100);
//					    at_com("AT+GMM\r\n",1000,100);
//						at_com(BtBuff,20,20);
//							do{
//									at_com_che6ck("AT+CIPRXGET=4,0\r\n","\r\nOK\r\n",retry_default,20,20);
//									at_com("AT+CIPSTATUS=0\r\n",20,20);
//								at_com("AT\r\n",20,20);
//								m++;
//								}
//							while(m<100);
 					
		
//		nrf_delay_ms(1000);
//		at_com("AT\r\n");
//		SEGGER_RTT_WriteString(0,"RESIDAM\r\n");

//		at_com("dsdsadasdsddsdsa\r\n");
// 		at_com("<16><31><\\0><4>MQTT<4><2><\\0>\r\n",10000,10);

//		at_com("  		\r\n",10,10);
//	  SEGGER_RTT_WriteString(0,"RESIDAM\r\n");
//		nrf_delay_ms(10000);
//		at_com("<15><\\0><19>cloud.smarthoom.com\r\n");
//  	at_com("AT+CIPRXGET=4,0\r\n");
//		Arrow_flag=0;
//		at_com("AT+CIPSTATUS=0\r\n");
//		at_com("AT+CIPRXGET=4,0\r\n");
			 
//		at_com_check("AT+CIPRXGET=2,0,4\r\n","\r\n+CIPRXGET: 2,0,4,0\r\n");
				 
			mqtt_flag=0; 
  	 }

		 
		 
		 
		 
		 
		 
		 
		 
        power_manage();
    }
}
